# ResBlock_CBAM_ECA


# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],  
   
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3

   # conv down
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5

   # Attention
   [-1, 1, ResBlock_CBAM_ECA2, [512, 256]],  # 6

   # conv down
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 8

   # Attention
   [-1, 1, ResBlock_CBAM_ECA2, [512, 512]],  # 9

   # conv down
   [-1, 1, Conv, [512, 3, 2]],  # 10-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #11

   # Attention
   [-1, 1, ResBlock_CBAM_ECA2, [512, 512]],  #12
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  #13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #14
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4   #15

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #16

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #17
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3   #18

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  #19 (P3/8-small)

   # conv-down merge
   [-1, 1, Conv, [256, 3, 2]],  #20
   [[-1, 16], 1, Concat, [1]],  # cat head P4   #21

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #22 (P4/16-medium)

   # conv-down merge
   [-1, 1, Conv, [512, 3, 2]],  #23
   [[-1, 13], 1, Concat, [1]],  # cat head P5   #24

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #25 (P5/32-large)

   # routing
   [5, 1, CBLinear, [[256]]], # 26
   [8, 1, CBLinear, [[256, 512]]], # 27
   [11, 1, CBLinear, [[256, 512, 512]]], #28

   # conv down
   [0, 1, Conv, [64, 3, 2]],  #29-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  #30-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  #31

   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  #32-P3/8
   [[26, 27, 28, -1], 1, CBFuse, [[0, 0, 0]]], #33

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  #34

   # conv down fuse
   [-1, 1, Conv, [512, 3, 2]],  #35-P4/16
   [[27, 28, -1], 1, CBFuse, [[1, 1]]], #36

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #37

   # conv down fuse
   [-1, 1, Conv, [512, 3, 2]],  #38-P5/32
   [[28, -1], 1, CBFuse, [[2]]], #39

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #40

   # detect
   [[34, 37, 40, 19, 22, 25], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
